# Regiment

### Paso 1. Importar librerias

In [2]:
import pandas as pd
import numpy as np

### Paso 2. Cree el DataFrame con los siguientes valores:

In [3]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [4]:
regimiento = pd.DataFrame(raw_data)

### Paso 3. Asígnalo a una variable llamada regimiento.
##### No olvides nombrar cada columna

In [5]:
regimiento

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Paso 4. ¿Cuál es la puntuación media preTestScore del regimiento Nighthawks?

In [6]:
night = regimiento.loc[0:4,['preTestScore']]
night.mean()

preTestScore    12.8
dtype: float64

### Paso 5. Presentar estadísticas generales por empresa

In [7]:
regimiento.groupby('company').describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

### Paso 6. ¿Cuál es la media de la puntuación preTest de cada empresa?

In [8]:
regimiento.set_index('company')

           regiment      name  preTestScore  postTestScore
company
1st      Nighthawks    Miller             4             25
1st      Nighthawks  Jacobson            24             94
2nd      Nighthawks       Ali            31             57
2nd      Nighthawks    Milner             2             62
1st        Dragoons     Cooze             3             70
1st        Dragoons     Jacon             4             25
2nd        Dragoons    Ryaner            24             94
2nd        Dragoons      Sone            31             57
1st          Scouts     Sloan             2             62
1st          Scouts     Piger             3             70
2nd          Scouts     Riani             2             62
2nd          Scouts       Ali             3             70

In [9]:
regimiento.groupby('company')[['preTestScore']].mean()

         preTestScore
company
1st          6.666667
2nd         15.500000

In [10]:
regimiento.groupby('regiment')[['preTestScore']].mean()

            preTestScore
regiment
Dragoons           15.50
Nighthawks         15.25
Scouts              2.50

### Paso 7. Presentar las puntuaciones medias preTest agrupadas por regimiento y compañía.

In [13]:
regimiento1 = regimiento.groupby(['regiment','company'])['preTestScore'].mean().unstack()
regimiento1

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Paso 8. Presentar las puntuaciones medias preTestScores agrupadas por regimiento y compañía sin indexación heirárquica.

In [17]:
regimiento.groupby(['regiment', 'company'])['preTestScore'].mean().reset_index()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

### Paso 9. Agrupar todo el marco de datos por regimiento y compañía

In [ ]:
pd.MultiIndex

In [31]:
regimiento.set_index(['regiment', 'company'])

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd           Ali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70

### Paso 10. ¿Cuál es el número de observaciones en cada regimiento y compañía

In [32]:
regimiento.groupby('regiment')[['company']].value_counts()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
Name: count, dtype: int64

### Paso 11. Iterar sobre un grupo e imprimir el nombre y todos los datos del regimiento. Haz una función llamada agrupa(variable)

In [36]:
def agrupa(grupo):
    for nombre, datos in regimiento.groupby('regiment'):
        if nombre == grupo:
            print(f"Nombre del regimiento: {nombre}")
            print(datos)

In [37]:
agrupa('Dragoons')

Nombre del regimiento: Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57